import math
# импорт библиотеки "математика"
print("Добрый день! Введите радиус в см: ")
a =input ()
# ввод радиуса
a =int(a)
# замена строчного типа данных целочисленный 
p = math.pi
# ввод переменной со значением ПИ
print("Длина окружности: ", (2*p*a), "cм")
# вывод 
print("Площадь круга: ", (p*a**2), "cм2 = ", int(p*a**2)/10000,  "м2" )
# вывод 
a1 =((a*2)/(2**(1/2)))
# вычисление стороны вписаный треугольника
print  ("Сторона вписанного квадрата: ", a1, "cм = ", a1/100, "м" )
# вывод 
a2 =((a*3)/(3**(1/2)))
# вычисление стороны вписанного треугольника
print("Сторона вписанного треугольника: ", a2, "cм = ", a2/100, "м" )
# вывод 
print("Сторона описанyого квадрата: ", a*2, "cм = ", a*2/100, "м" )
# вывод 
a3 =((a*6)/(3**(1/2)))
# вычисление стороны описаного треугольника
print("Сторона описанyого треугольника: ", a3, "cм = ", a3/100, "м" )
# вывод 
a4 =((a*2)/(1+(2**(1/2))))
# вычисление описанyого восьмиугольника
print("Сторона описанyого восьмиугольника: ", a4, "cм = ", a4/100, "м" )